Revit 2024 API
BuiltInFailures.StairRampFailures.InvalidRailProfile Property
 Profiles for one or more of the Rails are invalid. Make sure that every used Profile is a closed series of non-intersecting Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidRailProfile { get; }
Visual Basic
Public Shared ReadOnly Property InvalidRailProfile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidRailProfile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace